In [11]:
import numpy as np
import pandas as pd

In [24]:
df = pd.DataFrame({"col1": [3,4,5,np.nan], "col2":[8,np.nan, np.nan, 9], "col3": [3,4,5,8]})

In [25]:
df

   col1  col2  col3
0   3.0   8.0     3
1   4.0   NaN     4
2   5.0   NaN     5
3   NaN   9.0     8

In [14]:
df.dropna()

   col1  col2  col3
0   3.0   8.0     3

In [17]:
df

   col1  col2  col3
0   3.0   8.0     3
1   4.0   NaN     4
2   5.0   NaN     5
3   NaN   9.0     8

In [18]:
df.dropna(axis=1)

   col3
0     3
1     4
2     5
3     8

In [22]:
df

   col1  col2  col3
0   3.0   8.0     3
1   4.0   NaN     4
2   5.0   NaN     5
3   NaN   9.0     8

In [23]:
df.fillna(value="non_nan")

      col1     col2  col3
0      3.0      8.0     3
1      4.0  non_nan     4
2      5.0  non_nan     5
3  non_nan      9.0     8

In [26]:
df

   col1  col2  col3
0   3.0   8.0     3
1   4.0   NaN     4
2   5.0   NaN     5
3   NaN   9.0     8

In [29]:
df["col2"].fillna(value=df["col1"].mean(),inplace=True)

In [30]:
df

   col1  col2  col3
0   3.0   8.0     3
1   4.0   4.0     4
2   5.0   4.0     5
3   NaN   9.0     8